mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/common/s6e2c4xl.h
typedef struct stc_hsspi_rxfifo4_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_hsspi_rxfifo4_field_t;

typedef struct stc_hsspi_rxfifo5_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_hsspi_rxfifo5_field_t;

typedef struct stc_hsspi_rxfifo6_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_hsspi_rxfifo6_field_t;

typedef struct stc_hsspi_rxfifo7_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_hsspi_rxfifo7_field_t;

