mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/common/s6e2c4xl.h
/*******************************************************************************
* MFT Registers MFT1
*   Register Definition
*******************************************************************************/
#define FM_MFT1_OCU_OCCP0                         *((volatile uint16_t*)(0x40021102UL))
#define FM4_MFT1_OCU_OCCP0                        *((volatile uint16_t*)(0x40021102UL))
#define FM_MFT1_OCU_OCCP1                         *((volatile uint16_t*)(0x40021106UL))
#define FM4_MFT1_OCU_OCCP1                        *((volatile uint16_t*)(0x40021106UL))
#define FM_MFT1_OCU_OCCP2                         *((volatile uint16_t*)(0x4002110AUL))
#define FM4_MFT1_OCU_OCCP2                        *((volatile uint16_t*)(0x4002110AUL))
#define FM_MFT1_OCU_OCCP3                         *((volatile uint16_t*)(0x4002110EUL))
#define FM4_MFT1_OCU_OCCP3                        *((volatile uint16_t*)(0x4002110EUL))
#define FM_MFT1_OCU_OCCP4                         *((volatile uint16_t*)(0x40021112UL))
#define FM4_MFT1_OCU_OCCP4                        *((volatile uint16_t*)(0x40021112UL))
#define FM_MFT1_OCU_OCCP5                         *((volatile uint16_t*)(0x40021116UL))
#define FM4_MFT1_OCU_OCCP5                        *((volatile uint16_t*)(0x40021116UL))
#define FM_MFT1_OCU_OCSA10                        *((volatile  uint8_t*)(0x40021118UL))
#define FM4_MFT1_OCU_OCSA10                       *((volatile  uint8_t*)(0x40021118UL))
#define FM_MFT1_OCU_OCSB10                        *((volatile  uint8_t*)(0x40021119UL))
#define FM4_MFT1_OCU_OCSB10                       *((volatile  uint8_t*)(0x40021119UL))
#define FM_MFT1_OCU_OCSD10                        *((volatile uint16_t*)(0x4002111AUL))
#define FM4_MFT1_OCU_OCSD10                       *((volatile uint16_t*)(0x4002111AUL))
#define FM_MFT1_OCU_OCSA32                        *((volatile  uint8_t*)(0x4002111CUL))
#define FM4_MFT1_OCU_OCSA32                       *((volatile  uint8_t*)(0x4002111CUL))
#define FM_MFT1_OCU_OCSB32                        *((volatile  uint8_t*)(0x4002111DUL))
#define FM4_MFT1_OCU_OCSB32                       *((volatile  uint8_t*)(0x4002111DUL))
#define FM_MFT1_OCU_OCSD32                        *((volatile uint16_t*)(0x4002111EUL))
#define FM4_MFT1_OCU_OCSD32                       *((volatile uint16_t*)(0x4002111EUL))
#define FM_MFT1_OCU_OCSA54                        *((volatile  uint8_t*)(0x40021120UL))
#define FM4_MFT1_OCU_OCSA54                       *((volatile  uint8_t*)(0x40021120UL))
#define FM_MFT1_OCU_OCSB54                        *((volatile  uint8_t*)(0x40021121UL))
#define FM4_MFT1_OCU_OCSB54                       *((volatile  uint8_t*)(0x40021121UL))
#define FM_MFT1_OCU_OCSD54                        *((volatile uint16_t*)(0x40021122UL))
#define FM4_MFT1_OCU_OCSD54                       *((volatile uint16_t*)(0x40021122UL))
#define FM_MFT1_OCU_OCSC                          *((volatile  uint8_t*)(0x40021125UL))
#define FM4_MFT1_OCU_OCSC                         *((volatile  uint8_t*)(0x40021125UL))
#define FM_MFT1_OCU_OCSE0                         *((volatile uint16_t*)(0x40021128UL))
#define FM4_MFT1_OCU_OCSE0                        *((volatile uint16_t*)(0x40021128UL))
#define FM_MFT1_OCU_OCSE1                         *((volatile uint32_t*)(0x4002112CUL))
#define FM4_MFT1_OCU_OCSE1                        *((volatile uint32_t*)(0x4002112CUL))
#define FM_MFT1_OCU_OCSE2                         *((volatile uint16_t*)(0x40021130UL))
#define FM4_MFT1_OCU_OCSE2                        *((volatile uint16_t*)(0x40021130UL))
#define FM_MFT1_OCU_OCSE3                         *((volatile uint32_t*)(0x40021134UL))
#define FM4_MFT1_OCU_OCSE3                        *((volatile uint32_t*)(0x40021134UL))
#define FM_MFT1_OCU_OCSE4                         *((volatile uint16_t*)(0x40021138UL))
#define FM4_MFT1_OCU_OCSE4                        *((volatile uint16_t*)(0x40021138UL))
#define FM_MFT1_OCU_OCSE5                         *((volatile uint32_t*)(0x4002113CUL))
#define FM4_MFT1_OCU_OCSE5                        *((volatile uint32_t*)(0x4002113CUL))
#define FM_MFT1_FRT_TCCP0                         *((volatile uint16_t*)(0x40021142UL))
#define FM4_MFT1_FRT_TCCP0                        *((volatile uint16_t*)(0x40021142UL))
#define FM_MFT1_FRT_TCDT0                         *((volatile uint16_t*)(0x40021146UL))
#define FM4_MFT1_FRT_TCDT0                        *((volatile uint16_t*)(0x40021146UL))
#define FM_MFT1_FRT_TCSA0                         *((volatile uint16_t*)(0x40021148UL))
#define FM4_MFT1_FRT_TCSA0                        *((volatile uint16_t*)(0x40021148UL))
#define FM_MFT1_FRT_TCSC0                         *((volatile uint16_t*)(0x4002114AUL))
#define FM4_MFT1_FRT_TCSC0                        *((volatile uint16_t*)(0x4002114AUL))
#define FM_MFT1_FRT_TCCP1                         *((volatile uint16_t*)(0x4002114EUL))
#define FM4_MFT1_FRT_TCCP1                        *((volatile uint16_t*)(0x4002114EUL))
#define FM_MFT1_FRT_TCDT1                         *((volatile uint16_t*)(0x40021152UL))
#define FM4_MFT1_FRT_TCDT1                        *((volatile uint16_t*)(0x40021152UL))
#define FM_MFT1_FRT_TCSA1                         *((volatile uint16_t*)(0x40021154UL))
#define FM4_MFT1_FRT_TCSA1                        *((volatile uint16_t*)(0x40021154UL))
#define FM_MFT1_FRT_TCSC1                         *((volatile uint16_t*)(0x40021156UL))
#define FM4_MFT1_FRT_TCSC1                        *((volatile uint16_t*)(0x40021156UL))
#define FM_MFT1_FRT_TCCP2                         *((volatile uint16_t*)(0x4002115AUL))
#define FM4_MFT1_FRT_TCCP2                        *((volatile uint16_t*)(0x4002115AUL))
#define FM_MFT1_FRT_TCDT2                         *((volatile uint16_t*)(0x4002115EUL))
#define FM4_MFT1_FRT_TCDT2                        *((volatile uint16_t*)(0x4002115EUL))
#define FM_MFT1_FRT_TCSA2                         *((volatile uint16_t*)(0x40021160UL))
#define FM4_MFT1_FRT_TCSA2                        *((volatile uint16_t*)(0x40021160UL))
#define FM_MFT1_FRT_TCSC2                         *((volatile uint16_t*)(0x40021162UL))
#define FM4_MFT1_FRT_TCSC2                        *((volatile uint16_t*)(0x40021162UL))
#define FM_MFT1_FRT_TCAL                          *((volatile uint32_t*)(0x40021164UL))
#define FM4_MFT1_FRT_TCAL                         *((volatile uint32_t*)(0x40021164UL))
#define FM_MFT1_OCU_OCFS10                        *((volatile  uint8_t*)(0x40021168UL))
#define FM4_MFT1_OCU_OCFS10                       *((volatile  uint8_t*)(0x40021168UL))
#define FM_MFT1_OCU_OCFS32                        *((volatile  uint8_t*)(0x40021169UL))
#define FM4_MFT1_OCU_OCFS32                       *((volatile  uint8_t*)(0x40021169UL))
#define FM_MFT1_OCU_OCFS54                        *((volatile  uint8_t*)(0x4002116AUL))
#define FM4_MFT1_OCU_OCFS54                       *((volatile  uint8_t*)(0x4002116AUL))
#define FM_MFT1_ICU_ICFS10                        *((volatile  uint8_t*)(0x4002116CUL))
#define FM4_MFT1_ICU_ICFS10                       *((volatile  uint8_t*)(0x4002116CUL))
#define FM_MFT1_ICU_ICFS32                        *((volatile  uint8_t*)(0x4002116DUL))
#define FM4_MFT1_ICU_ICFS32                       *((volatile  uint8_t*)(0x4002116DUL))
#define FM_MFT1_ADCMP_ACFS10                      *((volatile  uint8_t*)(0x40021170UL))
#define FM4_MFT1_ADCMP_ACFS10                     *((volatile  uint8_t*)(0x40021170UL))
#define FM_MFT1_ADCMP_ACFS32                      *((volatile  uint8_t*)(0x40021171UL))
#define FM4_MFT1_ADCMP_ACFS32                     *((volatile  uint8_t*)(0x40021171UL))
#define FM_MFT1_ADCMP_ACFS54                      *((volatile  uint8_t*)(0x40021172UL))
#define FM4_MFT1_ADCMP_ACFS54                     *((volatile  uint8_t*)(0x40021172UL))
#define FM_MFT1_ICU_ICCP0                         *((volatile uint16_t*)(0x40021176UL))
#define FM4_MFT1_ICU_ICCP0                        *((volatile uint16_t*)(0x40021176UL))
#define FM_MFT1_ICU_ICCP1                         *((volatile uint16_t*)(0x4002117AUL))
#define FM4_MFT1_ICU_ICCP1                        *((volatile uint16_t*)(0x4002117AUL))
#define FM_MFT1_ICU_ICCP2                         *((volatile uint16_t*)(0x4002117EUL))
#define FM4_MFT1_ICU_ICCP2                        *((volatile uint16_t*)(0x4002117EUL))
#define FM_MFT1_ICU_ICCP3                         *((volatile uint16_t*)(0x40021182UL))
#define FM4_MFT1_ICU_ICCP3                        *((volatile uint16_t*)(0x40021182UL))
#define FM_MFT1_ICU_ICSA10                        *((volatile  uint8_t*)(0x40021184UL))
#define FM4_MFT1_ICU_ICSA10                       *((volatile  uint8_t*)(0x40021184UL))
#define FM_MFT1_ICU_ICSB10                        *((volatile  uint8_t*)(0x40021185UL))
#define FM4_MFT1_ICU_ICSB10                       *((volatile  uint8_t*)(0x40021185UL))
#define FM_MFT1_ICU_ICSA32                        *((volatile  uint8_t*)(0x40021188UL))
#define FM4_MFT1_ICU_ICSA32                       *((volatile  uint8_t*)(0x40021188UL))
#define FM_MFT1_ICU_ICSB32                        *((volatile  uint8_t*)(0x40021189UL))
#define FM4_MFT1_ICU_ICSB32                       *((volatile  uint8_t*)(0x40021189UL))
#define FM_MFT1_WFG_WFTF10                        *((volatile uint16_t*)(0x4002118EUL))
#define FM4_MFT1_WFG_WFTF10                       *((volatile uint16_t*)(0x4002118EUL))
#define FM_MFT1_WFG_WFTA10                        *((volatile uint16_t*)(0x40021190UL))
#define FM4_MFT1_WFG_WFTA10                       *((volatile uint16_t*)(0x40021190UL))
#define FM_MFT1_WFG_WFTB10                        *((volatile uint16_t*)(0x40021192UL))
#define FM4_MFT1_WFG_WFTB10                       *((volatile uint16_t*)(0x40021192UL))
#define FM_MFT1_WFG_WFTF32                        *((volatile uint16_t*)(0x40021196UL))
#define FM4_MFT1_WFG_WFTF32                       *((volatile uint16_t*)(0x40021196UL))
#define FM_MFT1_WFG_WFTA32                        *((volatile uint16_t*)(0x40021198UL))
#define FM4_MFT1_WFG_WFTA32                       *((volatile uint16_t*)(0x40021198UL))
#define FM_MFT1_WFG_WFTB32                        *((volatile uint16_t*)(0x4002119AUL))
#define FM4_MFT1_WFG_WFTB32                       *((volatile uint16_t*)(0x4002119AUL))
#define FM_MFT1_WFG_WFTF54                        *((volatile uint16_t*)(0x4002119EUL))
#define FM4_MFT1_WFG_WFTF54                       *((volatile uint16_t*)(0x4002119EUL))
#define FM_MFT1_WFG_WFTA54                        *((volatile uint16_t*)(0x400211A0UL))
#define FM4_MFT1_WFG_WFTA54                       *((volatile uint16_t*)(0x400211A0UL))
#define FM_MFT1_WFG_WFTB54                        *((volatile uint16_t*)(0x400211A2UL))
#define FM4_MFT1_WFG_WFTB54                       *((volatile uint16_t*)(0x400211A2UL))
#define FM_MFT1_WFG_WFSA10                        *((volatile uint16_t*)(0x400211A4UL))
#define FM4_MFT1_WFG_WFSA10                       *((volatile uint16_t*)(0x400211A4UL))
#define FM_MFT1_WFG_WFSA32                        *((volatile uint16_t*)(0x400211A8UL))
#define FM4_MFT1_WFG_WFSA32                       *((volatile uint16_t*)(0x400211A8UL))
#define FM_MFT1_WFG_WFSA54                        *((volatile uint16_t*)(0x400211ACUL))
#define FM4_MFT1_WFG_WFSA54                       *((volatile uint16_t*)(0x400211ACUL))
#define FM_MFT1_WFG_WFIR                          *((volatile uint16_t*)(0x400211B0UL))
#define FM4_MFT1_WFG_WFIR                         *((volatile uint16_t*)(0x400211B0UL))
#define FM_MFT1_WFG_NZCL                          *((volatile uint16_t*)(0x400211B4UL))
#define FM4_MFT1_WFG_NZCL                         *((volatile uint16_t*)(0x400211B4UL))
#define FM_MFT1_ADCMP_ACMP0                       *((volatile uint16_t*)(0x400211BAUL))
#define FM4_MFT1_ADCMP_ACMP0                      *((volatile uint16_t*)(0x400211BAUL))
#define FM_MFT1_ADCMP_ACMP1                       *((volatile uint16_t*)(0x400211BEUL))
#define FM4_MFT1_ADCMP_ACMP1                      *((volatile uint16_t*)(0x400211BEUL))
#define FM_MFT1_ADCMP_ACMP2                       *((volatile uint16_t*)(0x400211C2UL))
#define FM4_MFT1_ADCMP_ACMP2                      *((volatile uint16_t*)(0x400211C2UL))
#define FM_MFT1_ADCMP_ACMP3                       *((volatile uint16_t*)(0x400211C6UL))
#define FM4_MFT1_ADCMP_ACMP3                      *((volatile uint16_t*)(0x400211C6UL))
#define FM_MFT1_ADCMP_ACMP4                       *((volatile uint16_t*)(0x400211CAUL))
#define FM4_MFT1_ADCMP_ACMP4                      *((volatile uint16_t*)(0x400211CAUL))
#define FM_MFT1_ADCMP_ACMP5                       *((volatile uint16_t*)(0x400211CEUL))
#define FM4_MFT1_ADCMP_ACMP5                      *((volatile uint16_t*)(0x400211CEUL))
#define FM_MFT1_ADCMP_ACSA                        *((volatile uint16_t*)(0x400211D0UL))
#define FM4_MFT1_ADCMP_ACSA                       *((volatile uint16_t*)(0x400211D0UL))
#define FM_MFT1_ADCMP_ACSC0                       *((volatile  uint8_t*)(0x400211D4UL))
#define FM4_MFT1_ADCMP_ACSC0                      *((volatile  uint8_t*)(0x400211D4UL))
#define FM_MFT1_ADCMP_ACSD0                       *((volatile  uint8_t*)(0x400211D5UL))
#define FM4_MFT1_ADCMP_ACSD0                      *((volatile  uint8_t*)(0x400211D5UL))
#define FM_MFT1_ADCMP_ACMC0                       *((volatile  uint8_t*)(0x400211D6UL))
#define FM4_MFT1_ADCMP_ACMC0                      *((volatile  uint8_t*)(0x400211D6UL))
#define FM_MFT1_ADCMP_ACSC1                       *((volatile  uint8_t*)(0x400211D8UL))
#define FM4_MFT1_ADCMP_ACSC1                      *((volatile  uint8_t*)(0x400211D8UL))
#define FM_MFT1_ADCMP_ACSD1                       *((volatile  uint8_t*)(0x400211D9UL))
#define FM4_MFT1_ADCMP_ACSD1                      *((volatile  uint8_t*)(0x400211D9UL))
#define FM_MFT1_ADCMP_ACMC1                       *((volatile  uint8_t*)(0x400211DAUL))
#define FM4_MFT1_ADCMP_ACMC1                      *((volatile  uint8_t*)(0x400211DAUL))
#define FM_MFT1_ADCMP_ACSC2                       *((volatile  uint8_t*)(0x400211DCUL))
#define FM4_MFT1_ADCMP_ACSC2                      *((volatile  uint8_t*)(0x400211DCUL))
#define FM_MFT1_ADCMP_ACSD2                       *((volatile  uint8_t*)(0x400211DDUL))
#define FM4_MFT1_ADCMP_ACSD2                      *((volatile  uint8_t*)(0x400211DDUL))
#define FM_MFT1_ADCMP_ACMC2                       *((volatile  uint8_t*)(0x400211DEUL))
#define FM4_MFT1_ADCMP_ACMC2                      *((volatile  uint8_t*)(0x400211DEUL))
#define FM_MFT1_ADCMP_ACSC3                       *((volatile  uint8_t*)(0x400211E0UL))
#define FM4_MFT1_ADCMP_ACSC3                      *((volatile  uint8_t*)(0x400211E0UL))
#define FM_MFT1_ADCMP_ACSD3                       *((volatile  uint8_t*)(0x400211E1UL))
#define FM4_MFT1_ADCMP_ACSD3                      *((volatile  uint8_t*)(0x400211E1UL))
#define FM_MFT1_ADCMP_ACMC3                       *((volatile  uint8_t*)(0x400211E2UL))
#define FM4_MFT1_ADCMP_ACMC3                      *((volatile  uint8_t*)(0x400211E2UL))
#define FM_MFT1_ADCMP_ACSC4                       *((volatile  uint8_t*)(0x400211E4UL))
#define FM4_MFT1_ADCMP_ACSC4                      *((volatile  uint8_t*)(0x400211E4UL))
#define FM_MFT1_ADCMP_ACSD4                       *((volatile  uint8_t*)(0x400211E5UL))
#define FM4_MFT1_ADCMP_ACSD4                      *((volatile  uint8_t*)(0x400211E5UL))
#define FM_MFT1_ADCMP_ACMC4                       *((volatile  uint8_t*)(0x400211E6UL))
#define FM4_MFT1_ADCMP_ACMC4                      *((volatile  uint8_t*)(0x400211E6UL))
#define FM_MFT1_ADCMP_ACSC5                       *((volatile  uint8_t*)(0x400211E8UL))
#define FM4_MFT1_ADCMP_ACSC5                      *((volatile  uint8_t*)(0x400211E8UL))
#define FM_MFT1_ADCMP_ACSD5                       *((volatile  uint8_t*)(0x400211E9UL))
#define FM4_MFT1_ADCMP_ACSD5                      *((volatile  uint8_t*)(0x400211E9UL))
#define FM_MFT1_ADCMP_ACMC5                       *((volatile  uint8_t*)(0x400211EAUL))
#define FM4_MFT1_ADCMP_ACMC5                      *((volatile  uint8_t*)(0x400211EAUL))
#define FM_MFT1_FRT_TCSD                          *((volatile  uint8_t*)(0x400211ECUL))
#define FM4_MFT1_FRT_TCSD                         *((volatile  uint8_t*)(0x400211ECUL))

