mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/common/s6e2c4xl.h
/*******************************************************************************
* CAN Registers CAN1
*   Bitband Section
*******************************************************************************/
#define bFM_CAN1_CTRLR_INIT                       *((volatile  uint8_t *)(0x42C60000UL))
#define bFM4_CAN1_CTRLR_INIT                      *((volatile  uint8_t *)(0x42C60000UL))
#define bFM_CAN1_CTRLR_IE                         *((volatile  uint8_t *)(0x42C60004UL))
#define bFM4_CAN1_CTRLR_IE                        *((volatile  uint8_t *)(0x42C60004UL))
#define bFM_CAN1_CTRLR_SIE                        *((volatile  uint8_t *)(0x42C60008UL))
#define bFM4_CAN1_CTRLR_SIE                       *((volatile  uint8_t *)(0x42C60008UL))
#define bFM_CAN1_CTRLR_EIE                        *((volatile  uint8_t *)(0x42C6000CUL))
#define bFM4_CAN1_CTRLR_EIE                       *((volatile  uint8_t *)(0x42C6000CUL))
#define bFM_CAN1_CTRLR_DAR                        *((volatile  uint8_t *)(0x42C60014UL))
#define bFM4_CAN1_CTRLR_DAR                       *((volatile  uint8_t *)(0x42C60014UL))
#define bFM_CAN1_CTRLR_CCE                        *((volatile  uint8_t *)(0x42C60018UL))
#define bFM4_CAN1_CTRLR_CCE                       *((volatile  uint8_t *)(0x42C60018UL))
#define bFM_CAN1_CTRLR_TEST                       *((volatile  uint8_t *)(0x42C6001CUL))
#define bFM4_CAN1_CTRLR_TEST                      *((volatile  uint8_t *)(0x42C6001CUL))

#define bFM_CAN1_ERRCNT_RP                        *((volatile  uint8_t *)(0x42C600BCUL))
#define bFM4_CAN1_ERRCNT_RP                       *((volatile  uint8_t *)(0x42C600BCUL))

#define bFM_CAN1_IF1ARB_DIR                       *((volatile  uint8_t *)(0x42C60374UL))
#define bFM4_CAN1_IF1ARB_DIR                      *((volatile  uint8_t *)(0x42C60374UL))
#define bFM_CAN1_IF1ARB_XTD                       *((volatile  uint8_t *)(0x42C60378UL))
#define bFM4_CAN1_IF1ARB_XTD                      *((volatile  uint8_t *)(0x42C60378UL))
#define bFM_CAN1_IF1ARB_MSGVAL                    *((volatile  uint8_t *)(0x42C6037CUL))
#define bFM4_CAN1_IF1ARB_MSGVAL                   *((volatile  uint8_t *)(0x42C6037CUL))

#define bFM_CAN1_IF1CMSK_DATAB                    *((volatile  uint8_t *)(0x42C60240UL))
#define bFM4_CAN1_IF1CMSK_DATAB                   *((volatile  uint8_t *)(0x42C60240UL))
#define bFM_CAN1_IF1CMSK_DATAA                    *((volatile  uint8_t *)(0x42C60244UL))
#define bFM4_CAN1_IF1CMSK_DATAA                   *((volatile  uint8_t *)(0x42C60244UL))
#define bFM_CAN1_IF1CMSK_NEWDAT                   *((volatile  uint8_t *)(0x42C60248UL))
#define bFM4_CAN1_IF1CMSK_NEWDAT                  *((volatile  uint8_t *)(0x42C60248UL))
#define bFM_CAN1_IF1CMSK_CIP                      *((volatile  uint8_t *)(0x42C6024CUL))
#define bFM4_CAN1_IF1CMSK_CIP                     *((volatile  uint8_t *)(0x42C6024CUL))
#define bFM_CAN1_IF1CMSK_CONTROL                  *((volatile  uint8_t *)(0x42C60250UL))
#define bFM4_CAN1_IF1CMSK_CONTROL                 *((volatile  uint8_t *)(0x42C60250UL))
#define bFM_CAN1_IF1CMSK_ARB                      *((volatile  uint8_t *)(0x42C60254UL))
#define bFM4_CAN1_IF1CMSK_ARB                     *((volatile  uint8_t *)(0x42C60254UL))
#define bFM_CAN1_IF1CMSK_MASK                     *((volatile  uint8_t *)(0x42C60258UL))
#define bFM4_CAN1_IF1CMSK_MASK                    *((volatile  uint8_t *)(0x42C60258UL))
#define bFM_CAN1_IF1CMSK_WR_RD                    *((volatile  uint8_t *)(0x42C6025CUL))
#define bFM4_CAN1_IF1CMSK_WR_RD                   *((volatile  uint8_t *)(0x42C6025CUL))

#define bFM_CAN1_IF1CREQ_BUSY                     *((volatile  uint8_t *)(0x42C6023CUL))
#define bFM4_CAN1_IF1CREQ_BUSY                    *((volatile  uint8_t *)(0x42C6023CUL))

#define bFM_CAN1_IF1MCTR_EOB                      *((volatile  uint8_t *)(0x42C6039CUL))
#define bFM4_CAN1_IF1MCTR_EOB                     *((volatile  uint8_t *)(0x42C6039CUL))
#define bFM_CAN1_IF1MCTR_TXRQST                   *((volatile  uint8_t *)(0x42C603A0UL))
#define bFM4_CAN1_IF1MCTR_TXRQST                  *((volatile  uint8_t *)(0x42C603A0UL))
#define bFM_CAN1_IF1MCTR_RMTEN                    *((volatile  uint8_t *)(0x42C603A4UL))
#define bFM4_CAN1_IF1MCTR_RMTEN                   *((volatile  uint8_t *)(0x42C603A4UL))
#define bFM_CAN1_IF1MCTR_RXIE                     *((volatile  uint8_t *)(0x42C603A8UL))
#define bFM4_CAN1_IF1MCTR_RXIE                    *((volatile  uint8_t *)(0x42C603A8UL))
#define bFM_CAN1_IF1MCTR_TXIE                     *((volatile  uint8_t *)(0x42C603ACUL))
#define bFM4_CAN1_IF1MCTR_TXIE                    *((volatile  uint8_t *)(0x42C603ACUL))
#define bFM_CAN1_IF1MCTR_UMASK                    *((volatile  uint8_t *)(0x42C603B0UL))
#define bFM4_CAN1_IF1MCTR_UMASK                   *((volatile  uint8_t *)(0x42C603B0UL))
#define bFM_CAN1_IF1MCTR_INTPND                   *((volatile  uint8_t *)(0x42C603B4UL))
#define bFM4_CAN1_IF1MCTR_INTPND                  *((volatile  uint8_t *)(0x42C603B4UL))
#define bFM_CAN1_IF1MCTR_MSGLST                   *((volatile  uint8_t *)(0x42C603B8UL))
#define bFM4_CAN1_IF1MCTR_MSGLST                  *((volatile  uint8_t *)(0x42C603B8UL))
#define bFM_CAN1_IF1MCTR_NEWDAT                   *((volatile  uint8_t *)(0x42C603BCUL))
#define bFM4_CAN1_IF1MCTR_NEWDAT                  *((volatile  uint8_t *)(0x42C603BCUL))

#define bFM_CAN1_IF1MSK_MDIR                      *((volatile  uint8_t *)(0x42C602F8UL))
#define bFM4_CAN1_IF1MSK_MDIR                     *((volatile  uint8_t *)(0x42C602F8UL))
#define bFM_CAN1_IF1MSK_MXTD                      *((volatile  uint8_t *)(0x42C602FCUL))
#define bFM4_CAN1_IF1MSK_MXTD                     *((volatile  uint8_t *)(0x42C602FCUL))

#define bFM_CAN1_IF2ARB_DIR                       *((volatile  uint8_t *)(0x42C60974UL))
#define bFM4_CAN1_IF2ARB_DIR                      *((volatile  uint8_t *)(0x42C60974UL))
#define bFM_CAN1_IF2ARB_XTD                       *((volatile  uint8_t *)(0x42C60978UL))
#define bFM4_CAN1_IF2ARB_XTD                      *((volatile  uint8_t *)(0x42C60978UL))
#define bFM_CAN1_IF2ARB_MSGVAL                    *((volatile  uint8_t *)(0x42C6097CUL))
#define bFM4_CAN1_IF2ARB_MSGVAL                   *((volatile  uint8_t *)(0x42C6097CUL))

