mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/common/s6e2c4xl.h
#define bFM_CANFD0_ILE_EINT0                      *((volatile  uint8_t *)(0x42E00B80UL))
#define bFM4_CANFD0_ILE_EINT0                     *((volatile  uint8_t *)(0x42E00B80UL))
#define bFM_CANFD0_ILE_EINT1                      *((volatile  uint8_t *)(0x42E00B84UL))
#define bFM4_CANFD0_ILE_EINT1                     *((volatile  uint8_t *)(0x42E00B84UL))

#define bFM_CANFD0_ILS_RF0NL                      *((volatile  uint8_t *)(0x42E00B00UL))
#define bFM4_CANFD0_ILS_RF0NL                     *((volatile  uint8_t *)(0x42E00B00UL))
#define bFM_CANFD0_ILS_RF0WL                      *((volatile  uint8_t *)(0x42E00B04UL))
#define bFM4_CANFD0_ILS_RF0WL                     *((volatile  uint8_t *)(0x42E00B04UL))
#define bFM_CANFD0_ILS_RF0FL                      *((volatile  uint8_t *)(0x42E00B08UL))
#define bFM4_CANFD0_ILS_RF0FL                     *((volatile  uint8_t *)(0x42E00B08UL))
#define bFM_CANFD0_ILS_RF0LL                      *((volatile  uint8_t *)(0x42E00B0CUL))
#define bFM4_CANFD0_ILS_RF0LL                     *((volatile  uint8_t *)(0x42E00B0CUL))
#define bFM_CANFD0_ILS_RF1NL                      *((volatile  uint8_t *)(0x42E00B10UL))
#define bFM4_CANFD0_ILS_RF1NL                     *((volatile  uint8_t *)(0x42E00B10UL))
#define bFM_CANFD0_ILS_RF1WL                      *((volatile  uint8_t *)(0x42E00B14UL))
#define bFM4_CANFD0_ILS_RF1WL                     *((volatile  uint8_t *)(0x42E00B14UL))
#define bFM_CANFD0_ILS_RF1FL                      *((volatile  uint8_t *)(0x42E00B18UL))
#define bFM4_CANFD0_ILS_RF1FL                     *((volatile  uint8_t *)(0x42E00B18UL))
#define bFM_CANFD0_ILS_RF1LL                      *((volatile  uint8_t *)(0x42E00B1CUL))
#define bFM4_CANFD0_ILS_RF1LL                     *((volatile  uint8_t *)(0x42E00B1CUL))
#define bFM_CANFD0_ILS_HPML                       *((volatile  uint8_t *)(0x42E00B20UL))
#define bFM4_CANFD0_ILS_HPML                      *((volatile  uint8_t *)(0x42E00B20UL))
#define bFM_CANFD0_ILS_TCL                        *((volatile  uint8_t *)(0x42E00B24UL))
#define bFM4_CANFD0_ILS_TCL                       *((volatile  uint8_t *)(0x42E00B24UL))
#define bFM_CANFD0_ILS_TCFL                       *((volatile  uint8_t *)(0x42E00B28UL))
#define bFM4_CANFD0_ILS_TCFL                      *((volatile  uint8_t *)(0x42E00B28UL))
#define bFM_CANFD0_ILS_TFEL                       *((volatile  uint8_t *)(0x42E00B2CUL))
#define bFM4_CANFD0_ILS_TFEL                      *((volatile  uint8_t *)(0x42E00B2CUL))
#define bFM_CANFD0_ILS_TEFNL                      *((volatile  uint8_t *)(0x42E00B30UL))
#define bFM4_CANFD0_ILS_TEFNL                     *((volatile  uint8_t *)(0x42E00B30UL))
#define bFM_CANFD0_ILS_TEFWL                      *((volatile  uint8_t *)(0x42E00B34UL))
#define bFM4_CANFD0_ILS_TEFWL                     *((volatile  uint8_t *)(0x42E00B34UL))
#define bFM_CANFD0_ILS_TEFFL                      *((volatile  uint8_t *)(0x42E00B38UL))
#define bFM4_CANFD0_ILS_TEFFL                     *((volatile  uint8_t *)(0x42E00B38UL))
#define bFM_CANFD0_ILS_TEFLL                      *((volatile  uint8_t *)(0x42E00B3CUL))
#define bFM4_CANFD0_ILS_TEFLL                     *((volatile  uint8_t *)(0x42E00B3CUL))
#define bFM_CANFD0_ILS_TSWL                       *((volatile  uint8_t *)(0x42E00B40UL))
#define bFM4_CANFD0_ILS_TSWL                      *((volatile  uint8_t *)(0x42E00B40UL))
#define bFM_CANFD0_ILS_MRAFL                      *((volatile  uint8_t *)(0x42E00B44UL))
#define bFM4_CANFD0_ILS_MRAFL                     *((volatile  uint8_t *)(0x42E00B44UL))
#define bFM_CANFD0_ILS_TOOL                       *((volatile  uint8_t *)(0x42E00B48UL))
#define bFM4_CANFD0_ILS_TOOL                      *((volatile  uint8_t *)(0x42E00B48UL))
#define bFM_CANFD0_ILS_DRXL                       *((volatile  uint8_t *)(0x42E00B4CUL))
#define bFM4_CANFD0_ILS_DRXL                      *((volatile  uint8_t *)(0x42E00B4CUL))
#define bFM_CANFD0_ILS_BECL                       *((volatile  uint8_t *)(0x42E00B50UL))
#define bFM4_CANFD0_ILS_BECL                      *((volatile  uint8_t *)(0x42E00B50UL))
#define bFM_CANFD0_ILS_BEUL                       *((volatile  uint8_t *)(0x42E00B54UL))
#define bFM4_CANFD0_ILS_BEUL                      *((volatile  uint8_t *)(0x42E00B54UL))
#define bFM_CANFD0_ILS_ELOL                       *((volatile  uint8_t *)(0x42E00B58UL))
#define bFM4_CANFD0_ILS_ELOL                      *((volatile  uint8_t *)(0x42E00B58UL))
#define bFM_CANFD0_ILS_EPL                        *((volatile  uint8_t *)(0x42E00B5CUL))
#define bFM4_CANFD0_ILS_EPL                       *((volatile  uint8_t *)(0x42E00B5CUL))
#define bFM_CANFD0_ILS_EWL                        *((volatile  uint8_t *)(0x42E00B60UL))
#define bFM4_CANFD0_ILS_EWL                       *((volatile  uint8_t *)(0x42E00B60UL))
#define bFM_CANFD0_ILS_BOL                        *((volatile  uint8_t *)(0x42E00B64UL))
#define bFM4_CANFD0_ILS_BOL                       *((volatile  uint8_t *)(0x42E00B64UL))
#define bFM_CANFD0_ILS_WDIL                       *((volatile  uint8_t *)(0x42E00B68UL))
#define bFM4_CANFD0_ILS_WDIL                      *((volatile  uint8_t *)(0x42E00B68UL))
#define bFM_CANFD0_ILS_CRCEL                      *((volatile  uint8_t *)(0x42E00B6CUL))
#define bFM4_CANFD0_ILS_CRCEL                     *((volatile  uint8_t *)(0x42E00B6CUL))
#define bFM_CANFD0_ILS_BEL                        *((volatile  uint8_t *)(0x42E00B70UL))
#define bFM4_CANFD0_ILS_BEL                       *((volatile  uint8_t *)(0x42E00B70UL))
#define bFM_CANFD0_ILS_ACKEL                      *((volatile  uint8_t *)(0x42E00B74UL))
#define bFM4_CANFD0_ILS_ACKEL                     *((volatile  uint8_t *)(0x42E00B74UL))
#define bFM_CANFD0_ILS_FOEL                       *((volatile  uint8_t *)(0x42E00B78UL))
#define bFM4_CANFD0_ILS_FOEL                      *((volatile  uint8_t *)(0x42E00B78UL))
#define bFM_CANFD0_ILS_STEL                       *((volatile  uint8_t *)(0x42E00B7CUL))
#define bFM4_CANFD0_ILS_STEL                      *((volatile  uint8_t *)(0x42E00B7CUL))

