mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xl/common/s6e2c4xl.h
#define bFM_GPIO_DDRC_P0                          *((volatile  uint8_t *)(0x42DE4600UL))
#define bFM4_GPIO_DDRC_P0                         *((volatile  uint8_t *)(0x42DE4600UL))
#define bFM_GPIO_DDRC_P1                          *((volatile  uint8_t *)(0x42DE4604UL))
#define bFM4_GPIO_DDRC_P1                         *((volatile  uint8_t *)(0x42DE4604UL))
#define bFM_GPIO_DDRC_P2                          *((volatile  uint8_t *)(0x42DE4608UL))
#define bFM4_GPIO_DDRC_P2                         *((volatile  uint8_t *)(0x42DE4608UL))
#define bFM_GPIO_DDRC_P3                          *((volatile  uint8_t *)(0x42DE460CUL))
#define bFM4_GPIO_DDRC_P3                         *((volatile  uint8_t *)(0x42DE460CUL))
#define bFM_GPIO_DDRC_P4                          *((volatile  uint8_t *)(0x42DE4610UL))
#define bFM4_GPIO_DDRC_P4                         *((volatile  uint8_t *)(0x42DE4610UL))
#define bFM_GPIO_DDRC_P5                          *((volatile  uint8_t *)(0x42DE4614UL))
#define bFM4_GPIO_DDRC_P5                         *((volatile  uint8_t *)(0x42DE4614UL))
#define bFM_GPIO_DDRC_P6                          *((volatile  uint8_t *)(0x42DE4618UL))
#define bFM4_GPIO_DDRC_P6                         *((volatile  uint8_t *)(0x42DE4618UL))
#define bFM_GPIO_DDRC_P7                          *((volatile  uint8_t *)(0x42DE461CUL))
#define bFM4_GPIO_DDRC_P7                         *((volatile  uint8_t *)(0x42DE461CUL))
#define bFM_GPIO_DDRC_P8                          *((volatile  uint8_t *)(0x42DE4620UL))
#define bFM4_GPIO_DDRC_P8                         *((volatile  uint8_t *)(0x42DE4620UL))
#define bFM_GPIO_DDRC_P9                          *((volatile  uint8_t *)(0x42DE4624UL))
#define bFM4_GPIO_DDRC_P9                         *((volatile  uint8_t *)(0x42DE4624UL))
#define bFM_GPIO_DDRC_PA                          *((volatile  uint8_t *)(0x42DE4628UL))
#define bFM4_GPIO_DDRC_PA                         *((volatile  uint8_t *)(0x42DE4628UL))
#define bFM_GPIO_DDRC_PB                          *((volatile  uint8_t *)(0x42DE462CUL))
#define bFM4_GPIO_DDRC_PB                         *((volatile  uint8_t *)(0x42DE462CUL))
#define bFM_GPIO_DDRC_PC                          *((volatile  uint8_t *)(0x42DE4630UL))
#define bFM4_GPIO_DDRC_PC                         *((volatile  uint8_t *)(0x42DE4630UL))
#define bFM_GPIO_DDRC_PD                          *((volatile  uint8_t *)(0x42DE4634UL))
#define bFM4_GPIO_DDRC_PD                         *((volatile  uint8_t *)(0x42DE4634UL))
#define bFM_GPIO_DDRC_PE                          *((volatile  uint8_t *)(0x42DE4638UL))
#define bFM4_GPIO_DDRC_PE                         *((volatile  uint8_t *)(0x42DE4638UL))
#define bFM_GPIO_DDRC_PF                          *((volatile  uint8_t *)(0x42DE463CUL))
#define bFM4_GPIO_DDRC_PF                         *((volatile  uint8_t *)(0x42DE463CUL))

#define bFM_GPIO_DDRD_P0                          *((volatile  uint8_t *)(0x42DE4680UL))
#define bFM4_GPIO_DDRD_P0                         *((volatile  uint8_t *)(0x42DE4680UL))
#define bFM_GPIO_DDRD_P1                          *((volatile  uint8_t *)(0x42DE4684UL))
#define bFM4_GPIO_DDRD_P1                         *((volatile  uint8_t *)(0x42DE4684UL))
#define bFM_GPIO_DDRD_P2                          *((volatile  uint8_t *)(0x42DE4688UL))
#define bFM4_GPIO_DDRD_P2                         *((volatile  uint8_t *)(0x42DE4688UL))

#define bFM_GPIO_DDRE_P0                          *((volatile  uint8_t *)(0x42DE4700UL))
#define bFM4_GPIO_DDRE_P0                         *((volatile  uint8_t *)(0x42DE4700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42DE4708UL))
#define bFM4_GPIO_DDRE_P2                         *((volatile  uint8_t *)(0x42DE4708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x42DE470CUL))
#define bFM4_GPIO_DDRE_P3                         *((volatile  uint8_t *)(0x42DE470CUL))

#define bFM_GPIO_DDRF_P0                          *((volatile  uint8_t *)(0x42DE4780UL))
#define bFM4_GPIO_DDRF_P0                         *((volatile  uint8_t *)(0x42DE4780UL))
#define bFM_GPIO_DDRF_P1                          *((volatile  uint8_t *)(0x42DE4784UL))
#define bFM4_GPIO_DDRF_P1                         *((volatile  uint8_t *)(0x42DE4784UL))
#define bFM_GPIO_DDRF_P2                          *((volatile  uint8_t *)(0x42DE4788UL))
#define bFM4_GPIO_DDRF_P2                         *((volatile  uint8_t *)(0x42DE4788UL))
#define bFM_GPIO_DDRF_P3                          *((volatile  uint8_t *)(0x42DE478CUL))
#define bFM4_GPIO_DDRF_P3                         *((volatile  uint8_t *)(0x42DE478CUL))
#define bFM_GPIO_DDRF_P4                          *((volatile  uint8_t *)(0x42DE4790UL))
#define bFM4_GPIO_DDRF_P4                         *((volatile  uint8_t *)(0x42DE4790UL))
#define bFM_GPIO_DDRF_P5                          *((volatile  uint8_t *)(0x42DE4794UL))
#define bFM4_GPIO_DDRF_P5                         *((volatile  uint8_t *)(0x42DE4794UL))
#define bFM_GPIO_DDRF_P6                          *((volatile  uint8_t *)(0x42DE4798UL))
#define bFM4_GPIO_DDRF_P6                         *((volatile  uint8_t *)(0x42DE4798UL))
#define bFM_GPIO_DDRF_P7                          *((volatile  uint8_t *)(0x42DE479CUL))
#define bFM4_GPIO_DDRF_P7                         *((volatile  uint8_t *)(0x42DE479CUL))
#define bFM_GPIO_DDRF_P8                          *((volatile  uint8_t *)(0x42DE47A0UL))
#define bFM4_GPIO_DDRF_P8                         *((volatile  uint8_t *)(0x42DE47A0UL))
#define bFM_GPIO_DDRF_P9                          *((volatile  uint8_t *)(0x42DE47A4UL))
#define bFM4_GPIO_DDRF_P9                         *((volatile  uint8_t *)(0x42DE47A4UL))
#define bFM_GPIO_DDRF_PA                          *((volatile  uint8_t *)(0x42DE47A8UL))
#define bFM4_GPIO_DDRF_PA                         *((volatile  uint8_t *)(0x42DE47A8UL))
#define bFM_GPIO_DDRF_PB                          *((volatile  uint8_t *)(0x42DE47ACUL))
#define bFM4_GPIO_DDRF_PB                         *((volatile  uint8_t *)(0x42DE47ACUL))
#define bFM_GPIO_DDRF_PC                          *((volatile  uint8_t *)(0x42DE47B0UL))
#define bFM4_GPIO_DDRF_PC                         *((volatile  uint8_t *)(0x42DE47B0UL))

